In [1]:
import pandas as pd

In [2]:
s1 = pd.Series(['A','B','C','D'])

In [3]:
s2 = pd.Series(['E','F','G','H'])

In [4]:
s1

0    A
1    B
2    C
3    D
dtype: object

In [5]:
s2

0    E
1    F
2    G
3    H
dtype: object

In [6]:
s1 = pd.Series(['A','B','C','D'],index = [1,2,3,4])

In [7]:
s2 = pd.Series(['E','F','G','H'],index = [5,6,7,8])

In [8]:
pd.concat([s1,s2])

1    A
2    B
3    C
4    D
5    E
6    F
7    G
8    H
dtype: object

In [10]:
df1 = {"Name" : ["Alok, Gupta", "Krishna, Kishore", "Anuj, Kumar"],
      "Age": [19,19,19],
       "Gender": ["M","M","M"]
      }

In [11]:
df1

{'Name': ['Alok, Gupta', 'Krishna, Kishore', 'Anuj, Kumar'],
 'Age': [19, 19, 19],
 'Gender': ['M', 'M', 'M']}

In [12]:
df1 = pd.DataFrame(df1,index = [1,2,3])

In [13]:
df1

               Name  Age Gender
1       Alok, Gupta   19      M
2  Krishna, Kishore   19      M
3       Anuj, Kumar   19      M

In [14]:
df2={ "Name": ["Ravi","Mr Henry","Elizabeth"],
 "Age": [24, 31, 68],
 "Gender": ["male", "male", "female"]
}

In [15]:
df2 = pd.DataFrame(df2,index = [4,5,6])

In [16]:
df2

        Name  Age  Gender
4       Ravi   24    male
5   Mr Henry   31    male
6  Elizabeth   68  female

In [17]:
pd.concat([df1,df2])

               Name  Age  Gender
1       Alok, Gupta   19       M
2  Krishna, Kishore   19       M
3       Anuj, Kumar   19       M
4              Ravi   24    male
5          Mr Henry   31    male
6         Elizabeth   68  female

In [18]:
pd.concat([df1,df2],axis = 1)

               Name   Age Gender       Name   Age  Gender
1       Alok, Gupta  19.0      M        NaN   NaN     NaN
2  Krishna, Kishore  19.0      M        NaN   NaN     NaN
3       Anuj, Kumar  19.0      M        NaN   NaN     NaN
4               NaN   NaN    NaN       Ravi  24.0    male
5               NaN   NaN    NaN   Mr Henry  31.0    male
6               NaN   NaN    NaN  Elizabeth  68.0  female

In [19]:
df3 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
					'Name': ['Alok', 'Anuj', 'Kishore', 'ANkit']})

df4 = pd.DataFrame({'City': ['MUMBAI', 'PUNE', 'MUMBAI', 'DELHI'],
					'Age': ['19', '19', '19', '22']})

# the default behaviour is join='outer'
# inner join

result = pd.concat([df3, df4], axis=1)
# axis='columns'

In [20]:
result

    id     Name    City Age
0  A01     Alok  MUMBAI  19
1  A02     Anuj    PUNE  19
2  A03  Kishore  MUMBAI  19
3  A04    ANkit   DELHI  22

In [34]:
df1 = pd.DataFrame({'id1': [15,20,22,58],
					'Name': ['Alok', 'Ankit','Anuj', 'Kishore']})

In [35]:
df2 = pd.DataFrame({'id2': [12,13,14],
					'Name': ['Akash', 'Akhil','Allan']})

In [28]:
df1

   id     Name
0  15     Alok
1  20    Ankit
2  22     Anuj
3  58  Kishore

In [29]:
df2

   id   Name
0  12  Akash
1  13  Akhil
2  14  Allan

In [30]:
pd.concat([df1,df2])

   id     Name
0  15     Alok
1  20    Ankit
2  22     Anuj
3  58  Kishore
0  12    Akash
1  13    Akhil
2  14    Allan

In [31]:
pd.concat([df1,df2], ignore_index=True)

   id     Name
0  15     Alok
1  20    Ankit
2  22     Anuj
3  58  Kishore
4  12    Akash
5  13    Akhil
6  14    Allan

In [32]:
pd.concat([df1,df2], keys = ['x','y'])

     id     Name
x 0  15     Alok
  1  20    Ankit
  2  22     Anuj
  3  58  Kishore
y 0  12    Akash
  1  13    Akhil
  2  14    Allan

In [36]:
pd.concat([df1,df2], join = 'inner')

      Name
0     Alok
1    Ankit
2     Anuj
3  Kishore
0    Akash
1    Akhil
2    Allan

In [37]:
pd.concat([df1,df2], join = 'outer')

    id1     Name   id2
0  15.0     Alok   NaN
1  20.0    Ankit   NaN
2  22.0     Anuj   NaN
3  58.0  Kishore   NaN
0   NaN    Akash  12.0
1   NaN    Akhil  13.0
2   NaN    Allan  14.0

APPEND METHOD

In [38]:
import pandas as pd

In [39]:
books_df = pd.DataFrame({
    'Title' : ['Madhushala','1984','The Great Gatsby'],
    'Author' : ['Har. Rai Bachhan', 'George Orwell','Harper Lee']
})

In [40]:
new_book_1 = {'Title': 'The Catcher in the Rye', 'Author': 'J.D. Salinger'}
new_book_2 = {'Title': 'The Hobbit', 'Author': 'J.R.R. Tolkien'}

In [41]:
updated_books_df = books_df.append([new_book_1, new_book_2], ignore_index=True)

updated_books_df

AttributeError: 'DataFrame' object has no attribute 'append'

# one tp one joins

In [2]:
import pandas as pd

In [4]:
users_df = pd.DataFrame({
    'UserID': [1, 2, 3],
    'UserName': ['Alice', 'Bob', 'Charlie']
})
emails_df = pd.DataFrame({
    'UserID': [2, 3, 1],
    'Email': ['bob@example.com', 'charlie@example.com', 'alice@example.com']
})
one_to_one_joined_df = pd.merge(users_df, emails_df)
one_to_one_joined_df

   UserID UserName                Email
0       1    Alice    alice@example.com
1       2      Bob      bob@example.com
2       3  Charlie  charlie@example.com

# many to one joins

In [5]:
# Sample DataFrame 1: Orders (Many side)
orders_df = pd.DataFrame({
    'OrderID': [101, 102, 103, 104],
    'UserID': [1, 2, 1, 3],  # Note the duplicate UserID values
    'OrderDetail': ['Book', 'Laptop', 'Pen', 'Notebook']
})

# Sample DataFrame 2: Users (One side)
users_df = pd.DataFrame({
    'UserID': [1, 2, 3],
    'UserName': ['Alice', 'Bob', 'Charlie']
})

# Perform a many-to-one join on UserID
many_to_one_joined_df = pd.merge(orders_df, users_df)

many_to_one_joined_df

   OrderID  UserID OrderDetail UserName
0      101       1        Book    Alice
1      103       1         Pen    Alice
2      102       2      Laptop      Bob
3      104       3    Notebook  Charlie

# many to many joins

In [6]:

# Sample DataFrame 1: User Projects (Many side)
user_projects_df = pd.DataFrame({
    'UserID': [1, 2, 1, 3, 2],
    'ProjectID': ['A', 'A', 'B', 'B', 'C']  # Note: Projects A and B involve multiple users
})

# Sample DataFrame 2: Project Details (Many side)
project_details_df = pd.DataFrame({
    'ProjectID': ['A', 'A', 'B', 'C', 'C'],
    'Detail': ['Phase 1', 'Phase 2', 'Initial', 'Planning', 'Execution']  # Note: Projects A and C have multiple phases/details
})

# Perform a many-to-many join on ProjectID
many_to_many_joined_df = pd.merge(user_projects_df, project_details_df, on='ProjectID', how='inner')

many_to_many_joined_df

   UserID ProjectID     Detail
0       1         A    Phase 1
1       1         A    Phase 2
2       2         A    Phase 1
3       2         A    Phase 2
4       1         B    Initial
5       3         B    Initial
6       2         C   Planning
7       2         C  Execution

# on keywords

In [7]:
users_df = pd.DataFrame({
    'User_ID': [1,2,3],
    'Username': ['Alok','Anuj','Kishore']
})
emails_df = pd.DataFrame({
    'User_ID': [2,3,1],
    'Email': ['alokg@pwioi.com','anuj@pwioi.com','kishore@pwioi.com']
})

In [8]:
one_to_one_joined_df = pd.merge(users_df, emails_df, on= 'User_ID')
one_to_one_joined_df

   User_ID Username              Email
0        1     Alok  kishore@pwioi.com
1        2     Anuj    alokg@pwioi.com
2        3  Kishore     anuj@pwioi.com

# The left_on and right_on Keywords

In [14]:
import pandas as pd
employees_df = pd.DataFrame({
    'EmpID': [102, 103, 104],
    'Name': ['Alok', 'Anuj', 'Ankit']
})
salaries_df = pd.DataFrame({
    'EmployeeRef': [102, 103, 104],
    'Salary': [70000, 80000, 90000]
})

joined_df = pd.merge(employees_df, salaries_df, left_on = 'EmpID', right_on= 'EmployeeRef')
joined_df

   EmpID   Name  EmployeeRef  Salary
0    102   Alok          102   70000
1    103   Anuj          103   80000
2    104  Ankit          104   90000

In [1]:
import pandas as pd
employees_df = pd.DataFrame({
    'EmpID': [102, 103, 104],
    'Name': ['Alok', 'Anuj', 'Ankit']
})
salaries_df = pd.DataFrame({
    'EmployeeRef': [102, 103, 104],
    'Salary': [70000, 80000, 90000]
})

joined_df = pd.merge(employees_df, salaries_df, left_on = 'EmpID', right_on= 'EmployeeRef')
joined_df

   EmpID   Name  EmployeeRef  Salary
0    102   Alok          102   70000
1    103   Anuj          103   80000
2    104  Ankit          104   90000

In [2]:
import pandas as pd
employees_df = pd.DataFrame({
    'EmpID': [102, 103, 104],
    'Name': ['Alok', 'Anuj', 'Ankit']
})
salaries_df = pd.DataFrame({
    'EmployeeRef': [102, 103, 104],
    'Salary': [70000, 80000, 90000]
})

left_joined_df = pd.merge(employees_df, salaries_df, left_on = 'EmpID', right_on= 'EmployeeRef')
left_joined_df

   EmpID   Name  EmployeeRef  Salary
0    102   Alok          102   70000
1    103   Anuj          103   80000
2    104  Ankit          104   90000